In [15]:
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker
from sqlalchemy import Column
from sqlalchemy import String
from sqlalchemy import Integer
from sqlalchemy import Date

import pandas as pd

In [18]:
database_path = 'postgres://postgres:password@localhost:5432/SQL_Challenge'

engine = create_engine(f'postgresql://{database_path}')
conn = engine.connect()

data = pd.read_sql("select * from salaries", conn)

In [19]:
data.head()

  emp_no  salary   from_date     to_date
0  10001   60117  1986-06-26  1987-06-26
1  10002   65828  1996-08-03  1997-08-03
2  10003   40006  1995-12-03  1996-12-02
3  10004   40054  1986-12-01  1987-12-01
4  10005   78228  1989-09-12  1990-09-12